In [1]:
import pandas as pd
staff_df = pd.DataFrame([{'Name' : 'Abcd', 'Role':'Director of Hr'},
                         {'Name' : 'james', 'Role':'Course'},
                         {'Name' : 'Sally', 'Role':'Grader'}])
staff_df = staff_df.set_index('Name')
student_df = pd.DataFrame([{'Name' : 'Mike', 'Role':'Law'},
                         {'Name' : 'james', 'Role':'Business'},
                         {'Name' : 'Sally', 'Role':'Engineering'}])
student_df = student_df.set_index('Name')

In [13]:
pd.merge(staff_df, student_df, how ='inner',left_index =True,right_index=True)

       Role_x       Role_y
Name
james  Course     Business
Sally  Grader  Engineering

In [30]:
  pd.merge(staff_df, student_df, how ='outer',left_index =True,right_index=True)

  Name_x          Role_x Name_y       Role_y
0   Abcd  Director of Hr   Mike          Law
1  james          Course  james     Business
2  Sally          Grader  Sally  Engineering

In [16]:
  pd.merge(staff_df, student_df, how ='left',left_index =True,right_index=True)

               Role_x       Role_y
Name
Abcd   Director of Hr          NaN
james          Course     Business
Sally          Grader  Engineering

In [17]:
  pd.merge(staff_df, student_df, how ='right',left_index =True,right_index=True)

       Role_x       Role_y
Name
Mike      NaN          Law
james  Course     Business
Sally  Grader  Engineering

In [18]:
  pd.merge(staff_df, student_df, how ='inner')

Empty DataFrame
Columns: [Role]
Index: []

In [19]:
student_df = student_df.reset_index()
staff_df= staff_df.reset_index()

In [29]:
pd.merge(student_df,staff_df,how="right",on='Name')

    Name       Role_x          Role_y
0   Abcd          NaN  Director of Hr
1  james     Business          Course
2  Sally  Engineering          Grader

In [32]:
pd.merge(student_df,staff_df,how="inner")

Empty DataFrame
Columns: [Name, Role]
Index: []

In [33]:
staff_df = pd.DataFrame([{'Name' : 'Abcd', 'Role':'Director of Hr',
                         'Location':'State Street'},
                         {'Name' : 'james', 'Role':'Course',
                         'Location':'Washington Avenue'},
                         {'Name' : 'Sally', 'Role':'Grader',
                         'Location':'Washington Avenue'}])
student_df = pd.DataFrame([{'Name' : 'Mike', 'Role':'Law',
                         'Location':'1024 Billiard Avenue'},
                         {'Name' : 'james', 'Role':'Business',
                         'Location':'Fraternity House #22'},
                         {'Name' : 'Sally', 'Role':'Engineering',
                         'Location':'512 Wilson Crescent'}])

In [39]:
pd.merge(staff_df,student_df,how='left', on ='Name')

    Name          Role_x         Location_x       Role_y            Location_y
0   Abcd  Director of Hr       State Street          NaN                   NaN
1  james          Course  Washington Avenue     Business  Fraternity House #22
2  Sally          Grader  Washington Avenue  Engineering   512 Wilson Crescent